# BuiltInFailures.HostObjFailures Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
BuiltInFailures..::..HostObjFailures Members
BuiltInFailures..::..HostObjFailures Class Properties See Also
---
Provides a container of all Revit built-in FailureDefinitionId instances.
The BuiltInFailures..::..HostObjFailures type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| HostMismatch | Can't use this type in this host. |
| ReferencesNulled | One or more references are or have become invalid. |

# See Also
BuiltInFailures..::..HostObjFailures Class
Autodesk.Revit.DB Namespace